feat: integrate Mobile Model Playground
